<?php

/*
Plugin Name: RU Regions for WooCommerce
Plugin URI: http://github.com/NFSMONSTR/woocommerce-ru-regions
Description: A short plugin that adds RU regions to WooCommerce's list of states.
Version: 1.0
Author: NFS_MONSTR
Author URI: https://github.com/NFSMONSTR
*/

/**
 * Copyright (c) 2017 NFS_MONSTR. All rights reserved.
 *
 * Released under the GPL license
 * http://www.opensource.org/licenses/gpl-license.php
 *
 * This is an add-on for WordPress
 * http://wordpress.org/
 *
 * **********************************************************************
 * This program is free software; you can redistribute it and/or modify
 * it under the terms of the GNU General Public License as published by
 * the Free Software Foundation; either version 2 of the License, or
 * (at your option) any later version.
 *
 * This program is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the
 * GNU General Public License for more details.
 * **********************************************************************
 */


function  wc_ru_regions_add_counties( $states ) {

    $states['RU'] = array(
                            'AD' => 'Республика Адыгея (Адыгея)',
                            'BA' => 'Республика Башкортостан',
                            'BU' => 'Республика Бурятия',
                            'AL' => 'Республика Алтай',
                            'DA' => 'Республика Дагестан',
                            'IN' => 'Республика Ингушетия',
                            'KABA' => 'Кабардино-Балкарская Республика',
                            'KA' => 'Республика Калмыкия',
                            'KACH' => 'Карачаево-Черкесская Республика',
                            'KAR' => 'Республика Карелия',
                            'KOM' => 'Республика Коми',
                            'MAR' => 'Республика Марий Эл',
                            'MOR' => 'Республика Мордовия',
                            'SAH' => 'Республика Саха (Якутия)',
                            'SEV' => 'Республика Северная Осетия - Алания',
                            'TAT' => 'Республика Татарстан (Татарстан)',
                            'TI' => 'Республика Тыва',
                            'UD' => 'Удмуртская Республика',
                            'HA' => 'Республика Хакасия',
                            'CHE' => 'Чеченская Республика',
                            'CHU' => 'Чувашская Республика - Чувашия',
                            'ALT' => 'Алтайский край',
                            'KRD' => 'Краснодарский край',
                            'KRY' => 'Красноярский край',
                            'PRI' => 'Приморский край',
                            'STA' => 'Ставропольский край',
                            'HAB' => 'Хабаровский край',
                            'AM' => 'Амурская область',
                            'AR' => 'Архангельская область',
                            'AS' => 'Астраханская область',
                            'BE' => 'Белгородская область',
                            'BR' => 'Брянская область',
                            'VL' => 'Владимирская область',
                            'VG' => 'Волгоградская область',
                            'VOG' => 'Вологодская область',
                            'VR' => 'Воронежская область',
                            'IV' => 'Ивановская область',
                            'IR' => 'Иркутская область',
                            'KON' => 'Калининградская область',
                            'KLG' => 'Калужская область',
                            'KM' => 'Камчатский край',
                            'KE' => 'Кемеровская область',
                            'KI' => 'Кировская область',
                            'KO' => 'Костромская область',
                            'KU' => 'Курганская область',
                            'KUR' => 'Курская область',
                            'LEO' => 'Ленинградская область',
                            'LI' => 'Липецкая область',
                            'MA' => 'Магаданская область',
                            'MO' => 'Московская область',
                            'MU' => 'Мурманская область',
                            'NI' => 'Нижегородская область',
                            'NO' => 'Новгородская область',
                            'NOV' => 'Новосибирская область',
                            'OM' => 'Омская область',
                            'OR' => 'Оренбургская область',
                            'ORL' => 'Орловская область',
                            'PEN' => 'Пензенская область',
                            'PER' => 'Пермский край',
                            'PS' => 'Псковская область',
                            'RO' => 'Ростовская область',
                            'RY' => 'Рязанская область',
                            'SA' => 'Самарская область',
                            'SAR' => 'Саратовская область',
                            'SHL' => 'Сахалинская область',
                            'SV' => 'Свердловская область',
                            'SM' => 'Смоленская область',
                            'TA' => 'Тамбовская область',
                            'TV' => 'Тверская область',
                            'TO' => 'Томская область',
                            'TU' => 'Тульская область',
                            'TY' => 'Тюменская область',
                            'UL' => 'Ульяновская область',
                            'CH' => 'Челябинская область',
                            'ZA' => 'Забайкальский край',
                            'YA' => 'Ярославская область',
                            'DC' => 'г. Москва',
                            'LE' => 'Санкт-Петербург',
                            'EV' => 'Еврейская автономная область',
                            'NE' => 'Ненецкий автономный округ',
                            'HAN' => 'Ханты-Мансийский автономный округ - Югра',
                            'CHK' => 'Чукотский автономный округ',
                            'YM' => 'Ямало-Ненецкий автономный округ',
                            'KRM' => 'Республика Крым',
                            'SVS' => 'Севастополь',
                            'OTH' => 'Иные территории, включая город и космодром Байконур',
                           );
    return $states;

}

add_filter( 'woocommerce_states', 'wc_ru_regions_add_counties' );